---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryBearing
source: html/bcb5d57b-228c-a0e8-eef5-b04b3d96f4ef.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryBearing Property

"Bearing"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryBearing { get; }
```